make-proposal.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>make-proposal</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="make-proposal"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2013-04-25 02:55:51 CST"/>
<meta name="author" content="baohaojun"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<link rel="stylesheet" href="/css/default.css" type="text/css">
 <link rel="shortcut icon" href="/poison.png" type="image/png" />


</head>
<body>

<div id="preamble">
        <header id="header" class="inner">
<nav id="sub-nav" class="alignright">
        <div class="social">
                <a class="weibo" href="http://weibo.com/baohaojun" title="Weibo">Weibo</a>
                <a class="github" href="https://github.com/baohaojun" title="GitHub">GitHub</a>
                <a class="rss" href="/atom.xml" title="RSS">RSS</a>

        </div>
        <form class="search" action="http://google.com/search" method="get">
                <input class="alignright" type="text" name="q" results="0">
                <input type="hidden" name="q" value="site:baohaojun.github.io">
        </form>
</nav>

</header>

</div>

<div id="content">
<h1 class="title">make-proposal</h1>

<p>Hi, all
</p>
<p>
To speed up Marvell's android system build, I want to propose the
following improvements to our build system: a) enable parallel build
for all components and b) enable the use of ccache.
</p>
<p>
These changes are mainly focused on Marvell proprietary projects such
as uboot/obm/modules/kernel. Those projects using Android.mk has no
problem with these 2 goals.
</p>
<p>
I have pushed some review requests for this proposal, you can visit
them here: <a href="http://shgit.marvell.com/r/#q,owner:hjbao+status:open,n,z">my review requests</a>.
</p>

<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Make them all support parallel build</a>
<ul>
<li><a href="#sec-1-1">1.1 Why did we not support it?</a></li>
<li><a href="#sec-1-2">1.2 How to fix it?</a></li>
</ul>
</li>
<li><a href="#sec-2">2 Make them all support use of ccache</a>
<ul>
<li><a href="#sec-2-1">2.1 Why did we not support it?</a></li>
<li><a href="#sec-2-2">2.2 How to fix it?</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Make them all support parallel build</h2>
<div class="outline-text-2" id="text-1">


<p>
  Currently only the Kernel supports parallel build, the others does
  not.
</p>
<p>
  Even the kernel's parallel build support is defected; if you want a
  job number other than the default 4, you must use:
</p>



<pre class="example">export MAKE_JOBS=n
cd kernel; make
</pre>


<p>
  This is annoying, we should be able to use the Make program's
  default behavior:
</p>



<pre class="example">make -j n -C kernel
</pre>



</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Why did we not support it?</h3>
<div class="outline-text-3" id="text-1-1">


<p>
   Because we are using recursive make for these Marvell projects. The
   dependency is very difficult to get correct in recursive make. That
   is why Android has avoided it altogether. See <a href="http://www.google.com/search?q=recursive+make+considered+harmful">recursive make considered harmful</a>.
</p>
</div>

</div>

<div id="outline-container-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> How to fix it?</h3>
<div class="outline-text-3" id="text-1-2">


<p>
   There are 2 things.
</p>
<ul>
<li>Get the dependencies right.

<p>
     Kernel has no problem with dependencies.
</p>
<p>
     I have fixed some dependency issues for modules.
</p>
<p> 
     I have fixed some dependency issues for telephony.
</p>
</li>
<li>Use + and $(MAKE) in Makefiles.

<p>
     For the recursive make to take advantage of parallel build job
     server, you need write a '+' at the beginning of each <b>recursive</b>
     make rule, and write <code>$(MAKE)</code> instead of <code>make</code> directly. See
     the Make info page.
</p>
<p>
     Fortunately this can be easily done with a script, I have
     provided one, it is attached (fix-mk.pl).
</p></li>
</ul>



</div>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Make them all support use of ccache</h2>
<div class="outline-text-2" id="text-2">


<p>
  With the use of ccache, a full build of kernel (<code>make clean; make -j4</code>) can speed up from 10 minutes to a bare 2 minutes compared to
  when ccache is not used.
</p>
<p>
  This speed up is too good to be ignored. Android supports <a href="http://source.android.com/source/building.html#using-ccache">ccache</a> itself.
</p>

</div>

<div id="outline-container-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> Why did we not support it?</h3>
<div class="outline-text-3" id="text-2-1">


<p>
   There is a defect in our Makefiles: the <code>CROSS_COMPILE</code> variable is
   <b>both</b> <code>export</code>-ed and passed to a recursive make on the command
   line. The second caused it impossible to use ccache because it
   would introduce a space in the <code>CROSS_COMPILE</code> variable and cause
   the command line fail to parse.
</p>

</div>

</div>

<div id="outline-container-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> How to fix it?</h3>
<div class="outline-text-3" id="text-2-2">


<p>
   Do not pass the <code>CROSS_COMPILE</code> on the command line. It's unnecessary
   anyway, since it is already <code>export</code>-ed.
</p>
</div>
</div>
</div>
</div>

<div id="postamble">

<div id="disqus_container">
    <a href="#" class="right disqus" onclick="return false;">DISQUS!</a>
    <div style="margin-bottom:20px">
        <script type="text/javascript" charset="utf-8">
        (function(){
          var _w = 86 , _h = 20;
          var param = {
            url:location.href,
            type:'6',
            count:'', /**是否显示分享数，1显示(可选)*/
            appkey:'', /**您申请的应用appkey,显示分享来源(可选)*/
            title:'', /**分享的文字内容(可选，默认为所在页面的title)*/
            pic:'', /**分享图片的路径(可选)*/
            ralateUid:'1611427581', /**关联用户的UID，分享微博会@该用户(可选)*/
            language:'zh_cn', /**设置语言，zh_cn|zh_tw(可选)*/
            rnd:new Date().valueOf()
          }
          var temp = [];
          for( var p in param ){
            temp.push(p + '=' + encodeURIComponent( param[p] || '' ) )
          }
          document.write('<iframe allowTransparency="true" frameborder="0" scrolling="no" src="http://hits.sinajs.cn/A1/weiboshare.html?' + temp.join('&') + '" width="'+ _w+'" height="'+_h+'"></iframe>')
        })()
        </script>
    </div>
    <div id="disqus_thread"></div>
</div>

<script src="/js/post.js" type="text/javascript"></script>

<div id="about">
    <div class="about-content">
        <div class="clearfix">
            <div class="about-left">
                <h2>Contact</h2>
                <div class="weibo-con">
                    <iframe width="100%" height="75" class="share_self"  frameborder="0" scrolling="no" src="http://widget.weibo.com/weiboshow/index.php?language=&width=0&height=550&fansRow=2&ptype=1&speed=0&skin=1&isTitle=0&noborder=0&isWeibo=0&isFans=0&uid=1611427581&verifier=936f3b91&dpc=1"></iframe>
                </div>
            </div>
            <div class="about-left about-more">
                <h2>Projects</h2>
                    <a href="beagrep.html" title="Fastest grep">beagrep</a><br/>
                    <a href="skeleton-complete.html" title="Geekest Emacs Completion">skeleton-complete.el</a><br/>
            </div>
            <div class="about-left about-more">
                <h2>About</h2>
                <p>
                    Working<a href="http://marvell.com" class="external" target="_blank">@Marvell</a><br/>
                    Code<a href="https://github.com/baohaojun" class="external" target="_blank">@GitHub</a><br/>
                </p>
            </div>
        </div>

        <div class="copyright right">
            <p>Design by <a href="http://baohaojun.github.io/" title="BaoHaojun" target="_blank">Bao Haojun</a> © 2013</p>
        </div>
    </div>
</div>

</div>
</body>
</html>
